/*	1. 개요
	간단한 자신 소개와 수업 각오를 출력하기
*/

#include <stdio.h>			// printf

int main()
{
	printf("===========================================\n");
	printf("  학과: 컴퓨터과 \n");
	printf("  이름: 홍길동 \n");
	printf("  학번: 20130101\n");
	printf("  교수: 최고수\n");
	printf("  각오: 이번 학기에\n \tC 프로그래밍 언어를 열심히 공부해서 \n\t꼭 좋은 프로그래머가 되겠습니다. \n");
	printf("===========================================\n");
	
	return 0;
}
/*
===========================================
  학과: 컴퓨터과
  이름: 홍길동
  학번: 20130101
  교수: 최고수
  각오: 이번 학기에
        C 프로그래밍 언어를 열심히 공부해서
        꼭 좋은 프로그래머가 되겠습니다.
===========================================
계속하려면 아무 키나 누르십시오 . . .
*/