/*	3. 입출력
	0부터 15까지 8진수, 10진수, 16진수로 출력하는 프로그램을 작성하시오.
*/

#include <stdio.h>

int main()
{
	printf("8진수 \t10진수 \t16진수 \n");
	printf("--------------------------\n");
	printf("%4o \t %4d \t %4x \n", 1, 1, 1);
	printf("%4o \t %4d \t %4x \n", 2, 2, 2);
	printf("%4o \t %4d \t %4x \n", 3, 3, 3);
	printf("%4o \t %4d \t %4x \n", 4, 4, 4);
	printf("%4o \t %4d \t %4x \n", 5, 5, 5);
	printf("%4o \t %4d \t %4x \n", 6, 6, 6);
	printf("%4o \t %4d \t %4x \n", 7, 7, 7);
	printf("%4o \t %4d \t %4x \n", 8, 8, 8);
	printf("%4o \t %4d \t %4x \n", 9, 9, 9);
	printf("%4o \t %4d \t %4x \n", 10, 10, 10);
	printf("%4o \t %4d \t %4x \n", 11, 11, 11);
	printf("%4o \t %4d \t %4x \n", 12, 12, 12);
	printf("%4o \t %4d \t %4x \n", 13, 13, 13);
	printf("%4o \t %4d \t %4x \n", 14, 14, 14);
	printf("%4o \t %4d \t %4x \n", 15, 15, 15);
	
	return 0;
}


/*
8진수   10진수  16진수
--------------------------
   1        1       1
   2        2       2
   3        3       3
   4        4       4
   5        5       5
   6        6       6
   7        7       7
  10        8       8
  11        9       9
  12       10       a
  13       11       b
  14       12       c
  15       13       d
  16       14       e
  17       15       f
계속하려면 아무 키나 누르십시오 . . .
*/
