/*	5. 제어문
	50g 노란 공 15개, 100g 파란 공 9개, 120g 초록 공 10개가 있을 때
	각 색깔별로 반드시 하나씩은 있게 조합하여 총 합이 1500g이 되는 경우를 출력하기	
*/

#include <stdio.h>	// printf

int main()
{	
	int yellow, blue, green;
	int y_sum, b_sum, g_sum;
	int cnt;

	printf(" ====================================\n");
	printf("  노란 공     파란 공     초록 공 \n");
	printf(" ====================================\n");	

	cnt = 0;
	for ( yellow = 1 ; yellow <= 15 ; yellow++ ) 
	{	
		y_sum=yellow*50;
		for ( blue = 1 ;  blue <= 9; blue++ )
		{
			b_sum=blue*100;
			for ( green = 1 ;  green <= 10; green++ )
			{
				g_sum=green*120;
				if (y_sum + b_sum + g_sum == 1500)
				{
					cnt++;
					printf("%3d개(%3dg) %3d개(%3dg) %3d개(%4dg) \n", yellow, y_sum, blue, b_sum, green, g_sum);
				}
			}
		}
	}

	printf(" ====================================\n");
	printf(" 총 %d 가지\n", cnt);

	return 0;	
 }	
/*
 ====================================
  노란 공     파란 공     초록 공
 ====================================
  2개(100g)   2개(200g)  10개(1200g)
  2개(100g)   8개(800g)   5개( 600g)
  4개(200g)   1개(100g)  10개(1200g)
  4개(200g)   7개(700g)   5개( 600g)
  6개(300g)   6개(600g)   5개( 600g)
  8개(400g)   5개(500g)   5개( 600g)
 10개(500g)   4개(400g)   5개( 600g)
 12개(600g)   3개(300g)   5개( 600g)
 14개(700g)   2개(200g)   5개( 600g)
 ====================================
 총 9 가지
계속하려면 아무 키나 누르십시오 . . .
*/
